project-chip/connectedhomeip/examples/platform/stm32/STM32WBA65I-DK1/oemirot/Core/Src/stm32wbaxx_hal_timebase_tim.c
/*
 *
 *    Copyright (c) 2026 Project CHIP Authors
 *    All rights reserved.
 *
 *    Licensed under the Apache License, Version 2.0 (the "License");
 *    you may not use this file except in compliance with the License.
 *    You may obtain a copy of the License at
 *
 *        http://www.apache.org/licenses/LICENSE-2.0
 *
 *    Unless required by applicable law or agreed to in writing, software
 *    distributed under the License is distributed on an "AS IS" BASIS,
 *    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *    See the License for the specific language governing permissions and
 *    limitations under the License.
 */
/**
  ******************************************************************************
  * @file    stm32wbaxx_hal_timebase_tim_template.c
  * @author  MCD Application Team
  * @brief   HAL time base based on the hardware TIM.
  *
  *          This file overrides the native HAL time base functions (defined as weak)
  *          the TIM time base:
  *           + Initializes the TIM peripheral to generate a Period elapsed Event each 1ms
  *           + HAL_IncTick is called inside HAL_TIM_PeriodElapsedCallback ie each 1ms
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
                        ##### How to use this driver #####
  ==============================================================================
    [..]
    This file must be copied to the application folder and modified as follows:
    (#) Rename it to 'stm32wbaxx_hal_timebase_tim.c'
    (#) Add this file and the TIM HAL drivers to your project and uncomment
       HAL_TIM_MODULE_ENABLED define in stm32wbaxx_hal_conf.h

  @endverbatim
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32wbaxx_hal.h"

/** @addtogroup STM32WBAxx_HAL_Driver
 * @{
 */

/** @addtogroup HAL_TimeBase
 * @{
 */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define TIM_CNT_FREQ 1000000U /* Timer frequency counter : 1 MHz */
#define TIM_FREQ 1000U        /* Timer frequency : 1 kHz => to have 1 ms interrupt */

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
static TIM_HandleTypeDef TimHandle;

/* Private function prototypes -----------------------------------------------*/
void TIM17_IRQHandler(void);
#if (USE_HAL_TIM_REGISTER_CALLBACKS == 1U)
void TimeBase_TIM_PeriodElapsedCallback(TIM_HandleTypeDef * htim);
#endif
/* Private functions ---------------------------------------------------------*/

/**
 * @brief  This function configures the TIM16 as a time base source.
 *         The time source is configured  to have 1ms time base with a dedicated
 *         Tick interrupt priority.
 * @note   This function is called  automatically at the beginning of program after
 *         reset by HAL_Init() or at any time when clock is configured, by HAL_RCC_ClockConfig().
 * @param  TickPriority Tick interrupt priority.
 * @retval HAL Status
 */
HAL_StatusTypeDef HAL_InitTick(uint32_t TickPriority)
{
    RCC_ClkInitTypeDef clkconfig;
    uint32_t uwTimclock, uwAPB2Prescaler;
    uint32_t uwPrescalerValue;
    uint32_t pFLatency;
    HAL_StatusTypeDef Status;

    /* Enable TIM17 clock */
    __HAL_RCC_TIM17_CLK_ENABLE();

    /* Get clock configuration */
    HAL_RCC_GetClockConfig(&clkconfig, &pFLatency);

    /* Get APB2 prescaler */
    uwAPB2Prescaler = clkconfig.APB2CLKDivider;

    /* Compute TIM16 clock */
    if (uwAPB2Prescaler == RCC_HCLK_DIV1)
    {
        uwTimclock = HAL_RCC_GetPCLK2Freq();
    }
    else
    {
        uwTimclock = 2UL * HAL_RCC_GetPCLK2Freq();
    }

    /* Compute the prescaler value to have TIM16 counter clock equal to TIM_CNT_FREQ */
    uwPrescalerValue = (uint32_t) ((uwTimclock / TIM_CNT_FREQ) - 1U);

    /* Initialize TIM17 */
    TimHandle.Instance = TIM17;

    /* Initialize TIMx peripheral as follow:
    + Period = [(TIM_CNT_FREQ/TIM_FREQ) - 1]. to have a (1/TIM_FREQ) s time base.
    + Prescaler = (uwTimclock/TIM_CNT_FREQ - 1) to have a TIM_CNT_FREQ counter clock.
    + ClockDivision = 0
    + Counter direction = Up
    */
    TimHandle.Init.Period        = (TIM_CNT_FREQ / TIM_FREQ) - 1U;
    TimHandle.Init.Prescaler     = uwPrescalerValue;
    TimHandle.Init.ClockDivision = 0;
    TimHandle.Init.CounterMode   = TIM_COUNTERMODE_UP;
    Status                       = HAL_TIM_Base_Init(&TimHandle);
    if (Status == HAL_OK)
    {
        /* Start the TIM time Base generation in interrupt mode */
        Status = HAL_TIM_Base_Start_IT(&TimHandle);
        if (Status == HAL_OK)
        {
            if (TickPriority < (1UL << __NVIC_PRIO_BITS))
            {
                /* Enable the TIM17 global Interrupt */
                HAL_NVIC_SetPriority(TIM17_IRQn, TickPriority, 0);
                uwTickPrio = TickPriority;
            }
            else
            {
                Status = HAL_ERROR;
            }
        }
    }
#if (USE_HAL_TIM_REGISTER_CALLBACKS == 1U)
    HAL_TIM_RegisterCallback(&TimHandle, HAL_TIM_PERIOD_ELAPSED_CB_ID, TimeBase_TIM_PeriodElapsedCallback);
#endif

    HAL_NVIC_EnableIRQ(TIM17_IRQn);

    /* Return function Status */
    return Status;
}

/**
 * @brief  Suspend Tick increment.
 * @note   Disable the tick increment by disabling TIM16 update interrupt.
 * @param  None
 * @retval None
 */
void HAL_SuspendTick(void)
{
    /* Disable TIM17 update Interrupt */
    __HAL_TIM_DISABLE_IT(&TimHandle, TIM_IT_UPDATE);
}

/**
 * @brief  Resume Tick increment.
 * @note   Enable the tick increment by Enabling TIM16 update interrupt.
 * @param  None
 * @retval None
 */
void HAL_ResumeTick(void)
{
    /* Enable TIM17 Update interrupt */
    __HAL_TIM_ENABLE_IT(&TimHandle, TIM_IT_UPDATE);
}

/**
 * @brief  Period elapsed callback in non blocking mode
 * @note   This function is called  when TIM2 interrupt took place, inside
 * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
 * a global variable "uwTick" used as application time base.
 * @param  htim TIM handle
 * @retval None
 */
#if (USE_HAL_TIM_REGISTER_CALLBACKS == 1U)
void TimeBase_TIM_PeriodElapsedCallback(TIM_HandleTypeDef * htim)
#else
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef * htim)
#endif
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(htim);

    HAL_IncTick();
}

/**
 * @brief  This function handles TIM interrupt request.
 * @param  None
 * @retval None
 */
void TIM17_IRQHandler(void)
{
    HAL_TIM_IRQHandler(&TimHandle);
}

/**
 * @}
 */

/**
 * @}
 */
